import homchanovskiy from '../assets/img/homchanovskiy.jpg';
import homchanovskiy_1 from '../assets/img/homchanovskiy_1.jpg';
import sovetskaya17 from '../assets/img/sovetskaya17.jpg';
import sovetskaya17_1 from '../assets/img/sovetskaya17_1.jpg';
import sovetskaya17_2 from '../assets/img/sovetskaya17_2.jpg';
import sovetskaya17_3 from '../assets/img/sovetskaya17_3.jpg';
import sovetskaya17_4 from '../assets/img/sovetskaya17_4.jpg';
import sovetskaya17_5 from '../assets/img/sovetskaya17_5.jpg';
import gebeleva5 from '../assets/img/gebeleva5.jpg';
import gebeleva5_1 from '../assets/img/gebeleva5_1.jpg';
import gebeleva1 from '../assets/img/gebeleva1.jpg';
import korj from '../assets/img/korj.jpg';
import korol from '../assets/img/korol.jpg';
import shatko from '../assets/img/shatko.jpg';
import kovalevskaya from '../assets/img/kovalevskaya.jpg';
import zhukov from '../assets/img/zhukov.jpg';
import matrosov from '../assets/img/matrosov.jpg';
import semashko from '../assets/img/semashko.jpg';
import drozd from '../assets/img/drozd.jpg';
import drozd_1 from '../assets/img/drozd_1.jpg';

export type dbType = {
  id: string;
  type: 'road' | 'place';
  title: string;
  hint: string;
  description: string;
  geometry: number[][] | number[];
  images: string[];
  more?: string;
};

const db: dbType[] = [
  {
    id: '20',
    type: 'road',
    title: 'ул. Дрозда',
    hint: 'ул. Дрозда',
    description: `Улица Дрозда в Минске названа в честь участника Великой Отечественной войны Николая Прокофьевича Дрозда.    Участник Минского подполья в годы Великой Отечественной войны. Организовал и возглавил подпольную ячейку. На его жилище хранилось оружие, боеприпасы и медикаменты. Участвовал в подготовке операции по уничтожению В.Кубе. В конце сентября 1942 арестован вместе с семьей. После пыток вместе с ней казнен в Тростенецком лагере смерти.`,
    images: [drozd, drozd_1],
    geometry: [
      [53.906382, 27.528555],
      [53.905867, 27.528365],
      [53.905726, 27.528363],
      [53.904204, 27.528654],
      [53.903119, 27.528716],
    ],
    more: `https://minsknews.by/ulitsyi-minska-drozd/`,
  },
  {
    id: '19',
    type: 'road',
    title: 'ул. Семашко',
    hint: 'ул. Семашко',
    description: `Улица названа в честь советского партийного и государственного деятеля, врача, одного из организаторов системы здравоохранения в СССР, Семашко Николая Александровича`,
    images: [semashko, 'https://rossaprimavera.ru/static/files/31970afba15a.jpg'],
    geometry: [
      [53.864045, 27.485541],
      [53.864045, 27.485541],
      [53.86313, 27.487189],
      [53.862751, 27.487762],
      [53.860721, 27.490511],
      [53.858879, 27.491732],
      [53.858578, 27.492014],
      [53.85821, 27.492543],
      [53.85783, 27.493348],
      [53.857602, 27.494452],
      [53.857564, 27.495282],
      [53.857785, 27.498055],
      [53.857955, 27.497929],
      [53.864211, 27.496686],
      [53.867285, 27.495235],
      [53.868452, 27.49497],
      [53.869786, 27.494281],
    ],
    more: `https://ru.wikipedia.org/wiki/%D0%A1%D0%B5%D0%BC%D0%B0%D1%88%D0%BA%D0%BE,_%D0%9D%D0%B8%D0%BA%D0%BE%D0%BB%D0%B0%D0%B9_%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80%D0%BE%D0%B2%D0%B8%D1%87`,
  },
  {
    id: '18',
    type: 'road',
    title: 'ул. Матросова',
    hint: 'ул. Матросова',
    description: `Улица названа в честь  Героя Советского Союза, красноармейца, стрелка-автоматчика 2-го отдельного стрелкового батальона 91-й отдельной Сибирской добровольческой бригады имени И. В. Сталина 6-го Сталинского Сибирского добровольческого стрелкового корпуса оперативной группы генерала Герасимова Калининского фронта, члена ВЛКСМ,  Матросова Александра Матвеевича`,
    images: [
      matrosov,
      'https://warheroes.ru/content/images/photodocs/597/original/a25be7f22773d924c2f19ae3aee04718.jpg',
    ],
    geometry: [
      [53.879299, 27.511074],
      [53.877522, 27.512969],
    ],
    more: `https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D1%82%D1%80%D0%BE%D1%81%D0%BE%D0%B2,_%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80_%D0%9C%D0%B0%D1%82%D0%B2%D0%B5%D0%B5%D0%B2%D0%B8%D1%87`,
  },
  {
    id: '17',
    type: 'road',
    title: 'пр. Жукова',
    hint: 'пр. Жукова',
    description: `Проспект назван в честь советский полководца и государственного деятеля, маршала Советского Союза, четырежды Героя Советского Союза, кавалера двух орденов «Победа», шести орденов Ленина, Жукова Георгия Константиновича`,
    images: [
      zhukov,
      'https://library.nstu.ru/upload/medialibrary/c0e/c0ed16fb9478faf42e8f42b3d255b42f.jpg',
    ],
    geometry: [
      [53.894842, 27.498003],
      [53.89251, 27.499587],
      [53.88634, 27.502317],
      [53.885893, 27.502547],
      [53.885236, 27.503082],
      [53.88221, 27.506717],
      [53.880366, 27.510259],
      [53.873823, 27.528003],
    ],
    more: `https://ru.wikipedia.org/wiki/%D0%96%D1%83%D0%BA%D0%BE%D0%B2,_%D0%93%D0%B5%D0%BE%D1%80%D0%B3%D0%B8%D0%B9_%D0%9A%D0%BE%D0%BD%D1%81%D1%82%D0%B0%D0%BD%D1%82%D0%B8%D0%BD%D0%BE%D0%B2%D0%B8%D1%87`,
  },
  {
    id: '16',
    type: 'road',
    title: 'пер. Софии Ковалевской',
    hint: 'пер. Софии Ковалевской',
    description: `Переулок назван в честь первой женщины в мире, получившей должность профессора, а также первой женщиной-ученым в России, удостоившейся чести стать членом-корреспондентом Петербургской АН, Ковалевской Софии Васильевной `,
    images: [
      kovalevskaya,
      'http://мегафакты.рф/wp-content/uploads/interesnie-fakti-o-sofje-kovalevskoy.jpg',
    ],
    geometry: [
      [53.86543, 27.496207],
      [53.865466, 27.496673],
      [53.865432, 27.497148],
      [53.865329, 27.497513],
      [53.863947, 27.500909],
      [53.863853, 27.501208],
      [53.863833, 27.501594],
      [53.863915, 27.501984],
      [53.864263, 27.50302],
      [53.86432, 27.50331],
      [53.865263, 27.505891],
      [53.86595, 27.506897],
      [53.867978, 27.509238],
      [53.868352, 27.509966],
      [53.87007, 27.513528],
      [53.870169, 27.513649],
    ],
    more: `https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D0%B2%D0%B0%D0%BB%D0%B5%D0%B2%D1%81%D0%BA%D0%B0%D1%8F,_%D0%A1%D0%BE%D1%84%D1%8C%D1%8F_%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%8C%D0%B5%D0%B2%D0%BD%D0%B0`,
  },
  {
    id: '15',
    type: 'road',
    title: 'ул. Шатько',
    hint: 'ул. Шатько',
    description:
      'Улица названа в честь Викентия Даниловича Шатько, лидера партизанской группы, которая провела крупные диверсии на Минском железнодорожном узле',
    images: [shatko, 'https://minsknews.by/wp-content/uploads/2020/09/Bez-nazvaniya-3.png'],
    geometry: [
      [53.883875, 27.507901],
      [53.880676, 27.511268],
    ],
    more: 'https://minsknews.by/ulicza-imeni-shatko/',
  },
  {
    id: '14',
    type: 'road',
    title: 'ул. Короля',
    hint: 'ул. Короля',
    description:
      'Ул. Короля 7 Названа в честь Владимира Адамовича Короля, народного архитектора СССР. Первое название — Загородная, в начале тридцатых переименована в Обувную. Имя Короля присвоено после кончины архитектора.',
    images: [korol, 'https://blog.t-s.by/wp-content/uploads/2014/04/05.jpg'],
    geometry: [
      [53.904586, 27.528609],
      [53.904889, 27.532392],
      [53.904941, 27.533712],
    ],
    more: 'https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D1%80%D0%BE%D0%BB%D1%8C,_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%90%D0%B4%D0%B0%D0%BC%D0%BE%D0%B2%D0%B8%D1%87',
  },
  {
    id: '14',
    type: 'road',
    title: 'ул. Короля',
    hint: 'ул. Короля',
    description:
      'Ул. Короля 7 Названа в честь Владимира Адамовича Короля, народного архитектора СССР. Первое название — Загородная, в начале тридцатых переименована в Обувную. Имя Короля присвоено после кончины архитектора.',
    images: [korol, 'https://blog.t-s.by/wp-content/uploads/2014/04/05.jpg'],
    geometry: [
      [53.905015, 27.534775],
      [53.905059, 27.535742],
      [53.905051, 27.535985],
      [53.904984, 27.536219],
      [53.903112, 27.540556],
      [53.902904, 27.54112],
      [53.901499, 27.544358],
      [53.90125, 27.544823],
      [53.900244, 27.546333],
      [53.900206, 27.546336],
      [53.899979, 27.546053],
    ],
    more: 'https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D1%80%D0%BE%D0%BB%D1%8C,_%D0%92%D0%BB%D0%B0%D0%B4%D0%B8%D0%BC%D0%B8%D1%80_%D0%90%D0%B4%D0%B0%D0%BC%D0%BE%D0%B2%D0%B8%D1%87',
  },
  {
    id: '13',
    type: 'road',
    title: 'ул. Карпова',
    hint: 'ул. Карпова',
    description:
      'Улица названа в честь советского и российского шахматиста и политика, двенадцатого чемпиона мира по шахматам, международного гроссмейстера, заслуженного мастера спорта СССР, Карпова Анатолия Евгеньевича',
    images: [
      'https://342031.selcdn.ru/rusplt/517/936/885x581/Karopv_2.jpg',
      'https://chesswood.ru/wp-content/uploads/2016/04/Anatoly-Karpov-1.jpg',
    ],
    geometry: [
      [53.894446, 27.507055],
      [53.894355, 27.506989],
      [53.894103, 27.507006],
      [53.89227, 27.507346],
      [53.891955, 27.507472],
      [53.891856, 27.507469],
      [53.889707, 27.507058],
    ],
    more: 'https://ru.wikipedia.org/wiki/%D0%9A%D0%B0%D1%80%D0%BF%D0%BE%D0%B2,_%D0%90%D0%BD%D0%B0%D1%82%D0%BE%D0%BB%D0%B8%D0%B9_%D0%95%D0%B2%D0%B3%D0%B5%D0%BD%D1%8C%D0%B5%D0%B2%D0%B8%D1%87',
  },
  {
    id: '12',
    type: 'road',
    title: 'ул. Кальварийская',
    hint: 'ул. Кальварийская',
    description:
      'Улица названа в честь Кальварийского кладбища и одноимённого исторического предместья.',
    images: [
      'https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Kalvaryjskaja_str_p1.jpg/1200px-Kalvaryjskaja_str_p1.jpg',
      'https://planetabelarus.by/upload/resize_cache/iblock/049/1330_747_18e21fe612b4afb807a26ecc22279a1d9/049d4de1fccd3fb70ceecf94f7ab6f42.jpg',
    ],
    geometry: [
      [53.91005, 27.506764],
      [53.909686, 27.507941],
      [53.908631, 27.510451],
      [53.908272, 27.511591],
      [53.908057, 27.51307],
      [53.907826, 27.515618],
      [53.90752, 27.518936],
      [53.907346, 27.519984],
      [53.905219, 27.540879],
    ],
    more: 'https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D1%80%D0%B6,_%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D0%B8%D0%B9_%D0%97%D0%B0%D1%85%D0%B0%D1%80%D0%BE%D0%B2%D0%B8%D1%87',
  },
  {
    id: '11',
    type: 'road',
    title: 'ул. Коржа',
    hint: 'ул. Коржа',
    description:
      'Улица названа в честь одного из организаторов и руководителей партизанского движения на территории Пинской области в годы Великой Отечественной войны, Героя Советского Союза, Коржа Василия Захаровича',
    images: ['https://pinsklib.by/wp-content/uploads/2019/09/1ftr.jpg', korj],
    geometry: [
      [53.892055, 27.523468],
      [53.896634, 27.519377],
    ],
    more: 'https://ru.wikipedia.org/wiki/%D0%9A%D0%BE%D1%80%D0%B6,_%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D0%B8%D0%B9_%D0%97%D0%B0%D1%85%D0%B0%D1%80%D0%BE%D0%B2%D0%B8%D1%87',
  },
  {
    id: '10',
    type: 'place',
    title: 'ул. Гебелева, 1. Мемориальная доска в честь героя-подпольщика',
    hint: 'ул. Гебелева, 1. Мемориальная доска в честь героя-подпольщика',
    description:
      '15 октября 2005 года в 12.00 в г.Минске по ул.Гебелева 1 состоялась торжественная церемония открытия мемориальной доски в честь героя-подпольщика Михаила Гебелева.',
    images: [gebeleva5_1, gebeleva1],
    geometry: [53.900841, 27.540882],
    more: 'https://mfa.gov.by/press/news_mfa/ff0c74282b2f5860.html',
  },
  {
    id: '9',
    type: 'place',
    title: 'ул. Гебелева, 5. Мемориальная доска к 75-летию Великой Победы.',
    hint: 'ул. Гебелева, 5. Мемориальная доска к 75-летию Великой Победы.',
    description:
      'Во время прохождения эстафеты памяти «Беларусь помнит» в Минском профессионально-техническом колледже строителей было принято решение создать Музей трагедии и героизма Минского гетто, также открыть скульптурную композицию, посвященную сопротивлению гетто оккупантам и создания мурала, отображающего подвиг Михаила Гебелева.',
    images: [gebeleva5, gebeleva5_1],
    geometry: [53.899992, 27.539993],
    more: 'https://ru.wikipedia.org/wiki/%D0%93%D0%B5%D0%B1%D0%B5%D0%BB%D0%B5%D0%B2,_%D0%9C%D0%B8%D1%85%D0%B0%D0%B8%D0%BB_%D0%9B%D1%8C%D0%B2%D0%BE%D0%B2%D0%B8%D1%87',
  },
  {
    id: '8',
    type: 'place',
    title: 'Мемориал «Память»',
    hint: 'Мемориал «Память»',
    description:
      'Cпиной к проспекту Дзержинского располагается бронзовая скульптура сидящей женщины, сжимающей в руках пилотку. Она символизирует всех вдов и матерей, потерявших мужей и сыновей в годы Великой Отечественной войны. Перед ней — небольшой обелиск над братской могилой 24 неизвестных солдат. Дальше - 11 звезд с именами советских бойцов, павших в боях за Минск.',
    images: [
      'https://travelagency.by/upload/iblock/65c/Memorial_pamyat_mat_minsk_min.jpg',
      'https://musei-smerti.ru/wp-content/uploads/2017/10/Memorial-pamyat-minsk-min.jpg',
    ],
    geometry: [53.868087, 27.489458],
  },
  {
    id: '7',
    type: 'place',
    title: 'Добромысленский переулок, 3',
    hint: 'Добромысленский переулок, 3',
    description:
      'Мемориальная доска советским подпольщикам. "В квартире № 53 этого дома в 1942 г. действовала рация советских разведчиков. Хозяевами квартиры были подпольщики А. Д. и М. Т. Загорские".',
    images: [],
    geometry: [53.891062, 27.539409],
  },
  {
    id: '6',
    type: 'place',
    title: 'ул. Советская 17, мемориальная доска Попову В.В.',
    hint: 'ул. Советская 17, мемориальная доска Попову В.В.',
    description:
      'Дом Эммануила Абрампольского, директора одного из минских банков, построен в 1912 году по проекту белорусского архитектора Станислава Гайдукевича. В 1917 году дом был национализирован большевистскими властями. В 1920-е годы в доме размещались квартиры сотрудников белорусского отделения ОГПУ (Объединенное государственное политическое управление), позже — НКВД. Также здесь жили представители высшего государственного, партийного и хозяйственного руководства БССР.',
    geometry: [53.896414, 27.548456],
    images: [sovetskaya17_4, sovetskaya17_5],
    more: 'https://csl.bas-net.by/personalii/61828/popov-vasilii-vasilievich/',
  },
  {
    id: '5',
    type: 'place',
    title: `ул. Советская, 17. Памятная доска Славинскому А.В.`,
    hint: 'ул. Советская, 17. Памятная доска Славинскому А.В.',
    description:
      'Надпись на табличке: "В этом доме с 1919 - 1931 гг. жил Адам Семёнович Славинский. Член КПСС в 1907 г., видный партийный и государственный деятель Белорусской ССР".',
    geometry: [53.896552, 27.54887],
    images: [sovetskaya17_2, sovetskaya17_3],
    more: 'https://ru.wikipedia.org/wiki/%D0%A1%D0%BB%D0%B0%D0%B2%D0%B8%D0%BD%D1%81%D0%BA%D0%B8%D0%B9,_%D0%90%D0%B4%D0%B0%D0%BC_%D0%A1%D0%B5%D0%BC%D1%91%D0%BD%D0%BE%D0%B2%D0%B8%D1%87',
  },
  {
    id: '4',
    type: 'place',
    title: 'ул. Советская 17',
    hint: 'ул. Советская 17',
    description:
      'В этом доме жил Вацлав Антонович Богуцкий (1884-1937гг.) – революционер, советский партийный деятель, секретарь Центрального Бюро КП Белоруссии, член Исполкома-Коминтерна.',
    geometry: [53.896586, 27.548635],
    images: [sovetskaya17_1, sovetskaya17],
    more: 'https://ru.wikipedia.org/wiki/%D0%91%D0%BE%D0%B3%D1%83%D1%86%D0%BA%D0%B8%D0%B9,_%D0%92%D0%B0%D1%86%D0%BB%D0%B0%D0%B2_%D0%90%D0%BD%D1%82%D0%BE%D0%BD%D0%BE%D0%B2%D0%B8%D1%87',
  },
  {
    id: '3',
    type: 'place',
    title: 'Памятник Хомчановскому В.А.',
    hint: 'Памятник Хомчановскому В.А.',
    description:
      'С августа 1941 года — член Россонской подпольной группы. С апреля 1942 года — заместитель командира по разведке партизанского отряда имени Н.А. Щорса бригады имени К.К. Рокоссовского. Участвовал в засадах и диверсиях, в том числе на железнодорожном мосту через реку Дрисса, а так же в ликвидации фашистских гарнизонов в сёлах и образовании партизанской зоны.',
    geometry: [53.88598, 27.506649],
    images: [homchanovskiy_1, homchanovskiy],
  },
  {
    id: '2',
    type: 'place',
    title: 'Памятник Белорусам - героям космоса',
    hint: 'Памятник Белорусам - героям космоса',
    description:
      'Памятный знак установлен на улице Космонавтов в городе Минске и посвящен белорусским космонавтам. На барельефе изображены портреты уроженцев Беларуси, которые побывали в космосе, - Петра Климука, Владимира Коваленка и Олега Новицкого. Создал памятный знак скульптор, народный художник Беларуси Иван Миско.',
    geometry: [53.853722, 27.475181],
    images: [
      'https://g3.dcdn.lt/images/pix/rusu-redakcija-16858-79029373.jpg',
      'https://citydog.io/content/editor_images/2018/09_september/03_14638/IMG_1517.jpg',
    ],
    more: 'https://minsknews.by/v-minske-torzhestvenno-otkryili-pamyatnyiy-znak-belorusam-geroyam-kosmosa/',
  },
  {
    id: '1',
    type: 'road',
    title: 'ул. Академика Курчатова',
    hint: 'ул. Академика Курчатова',
    description:
      'Улица названа в честь трижды Героя Социалистического Труда, академика АН СССР и АН Узбекской ССР, доктора физико-математических наук, профессора,  основателя и первого директора Института атомной энергии, Курчатова Игоря Васильевича',
    geometry: [
      [53.83578, 27.468698],
      [53.837911, 27.472917],
      [53.841098, 27.477736],
    ],
    images: [
      'http://cdn.iz.ru/sites/default/files/styles/900x506/public/article-2018-01/RIAN_83854.HR_.ru_.jpg?itok=Qcf5FTh5',
      'https://mcdn.tvzvezda.ru/storage/news_other_images/2019/11/30/e1292afe9b684332a8b1b4bd2952af43.jpg',
    ],
    more: 'https://ru.wikipedia.org/wiki/%D0%9A%D1%83%D1%80%D1%87%D0%B0%D1%82%D0%BE%D0%B2,_%D0%98%D0%B3%D0%BE%D1%80%D1%8C_%D0%92%D0%B0%D1%81%D0%B8%D0%BB%D1%8C%D0%B5%D0%B2%D0%B8%D1%87',
  },
];

export default db;
